{
  "backend/main.mo": "Motoko backend storing contact forms and courses with add, fetch, and sorted list query functions.",
  "feature_evidence.json": "Feature evidence report listing two UI header-related features and their associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across pages, components, hooks, and config.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode overrides, and global styles.",
  "frontend/index.html": "Main HTML entry with meta tags, favicon, and script loading the React app root.",
  "frontend/src/App.tsx": "Sets up TanStack Router with Layout and routes for Home, About, Courses, and Contact pages.",
  "frontend/src/components/Layout.tsx": "Layout component providing header, responsive navigation, branding, CTA buttons, mobile menu, and outlet rendering.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated/anonymous backend actors with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching courses, submitting contact forms, and retrieving contact form data.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, and custom brand color utility classes.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero, vision, and mission sections using styled cards and brand colors.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact page with a form, validation, scroll handling, and contact info cards.",
  "frontend/src/pages/CoursesPage.tsx": "Displays course offerings in structured card sections with enroll buttons navigating to contact page.",
  "frontend/src/pages/FacultyPage.tsx": "Empty file placeholder for the Faculty page.",
  "frontend/src/pages/HomePage.tsx": "Home page containing hero content, program highlights, and value propositions with navigation options.",
  "frontend/src/pages/ResultsPage.tsx": "Empty file placeholder for the Results page.",
  "frontend/src/pages/WhyChooseUsPage.tsx": "Empty file placeholder for the Why Choose Us page.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, custom colors tied to CSS variables, plugins, and extended styles.",
  "project_state.json": "Tracks project metadata, known header styling issues, and feature requests for fixing company name wrapping and color. Includes existing features, pending requests, and project configuration fields."
}