{
  "kind": "build_request",
  "title": "Fix header company name wrapping and set brand blue text color",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the header (logo + company name area) so the company name renders as a single line to the right of the logo (no line break/wrapping into two lines).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the company name should be in one line not in two line in the header section just beside the logo"
        ]
      },
      "acceptanceCriteria": [
        "In the sticky header, the company name appears on one line next to the logo at common viewport sizes (mobile and desktop) without splitting into two stacked lines.",
        "The header layout remains aligned (logo and company name vertically centered) and does not overlap the navigation or mobile menu button."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the header company name text color from the current purple to the brand blue #010080.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the colour of the text is purple as of now ,change the colour to the brand colour #010080 blue."
        ]
      },
      "acceptanceCriteria": [
        "The company name text in the header uses hex color #010080.",
        "No other unrelated text colors across the site are changed as part of this fix."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/src/components/ui (compose them only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Changing the footer styling or footer brand text color.",
    "Changing the logo image asset or its dimensions.",
    "Reworking global Tailwind theme colors beyond what is required to make the header company name use #010080."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}