{
  "kind": "build_request",
  "title": "Fix Home page hero photo not fully visible",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Home page hero image rendering so the full hero photo is visible (not cropped or cut off) across common breakpoints (mobile, tablet, desktop). Update the hero image container/CSS so the image scales responsively and preserves the full photo (e.g., use a constrained aspect ratio and an object-fit strategy that does not crop).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "the fuul photo is not visible"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the hero image is visible and loads successfully.",
        "On mobile, tablet, and desktop widths, the full photo content is visible (no unintended cropping/cut-off).",
        "The hero section layout remains stable (no overflow causing the image to disappear or be clipped)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify the deployed/static asset path for the hero image is correct and that the file exists in the frontend static assets. If the hero image fails to load, update the code to point to the correct generated asset filename/path and ensure the hero image displays.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "the fuul photo is not visible"
        ]
      },
      "acceptanceCriteria": [
        "The hero image request returns 200 (no broken image icon).",
        "The <img> in frontend/src/pages/HomePage.tsx references the correct static path under /assets/generated/ for the hero image."
      ]
    }
  ],
  "constraints": [
    "Do not serve images via the backend; use frontend static assets (e.g., /assets/generated).",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing backend data models or adding new backend endpoints.",
    "Redesigning unrelated pages (About, Courses, Contact) beyond what is necessary to fix hero image visibility."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Ensure the full uploaded photo is visible within a 1600x800 frame without cropping (image-2.png > hero-sss.dim_1600x800.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}