{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Home page hero image visibility across breakpoints",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Home page hero image layout/CSS so the full photo is always visible (no cropping) on mobile/tablet/desktop.",
      "acceptanceCriteria": [
        "On the Home page, the hero image is visible and loads successfully.",
        "On mobile, tablet, and desktop widths, the full photo content is visible (no unintended cropping/cut-off).",
        "The hero section layout remains stable (no overflow causing the image to disappear or be clipped)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Adjust the hero image wrapper and <img> styling to use a constrained aspect ratio and an object-fit strategy that preserves the entire photo (e.g., container with a consistent responsive aspect ratio + img sized to fill container using object-contain), and ensure no parent overflow/clipping hides the image at common breakpoints."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Confirm the hero image static asset exists and that HomePage references the correct /assets/generated path so the image always loads.",
      "acceptanceCriteria": [
        "The hero image request returns 200 (no broken image icon).",
        "The <img> in frontend/src/pages/HomePage.tsx references the correct static path under /assets/generated/ for the hero image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Verify the hero <img> src points to the correct generated asset path and filename (use the exact generated asset hero image path under /assets/generated), updating the reference if needed so it reliably loads in production builds."
        },
        {
          "path": "frontend/public/assets/generated/hero-sss.dim_1600x800.png",
          "operation": "create",
          "description": "Ensure the generated hero image asset exists at this exact static path for deployment (place/copy the provided generated file here if it is currently missing or located elsewhere)."
        }
      ]
    }
  ]
}