{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Header mobile clarity: remove tagline and optimize institute name layout",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Remove the tagline from the header while keeping it in the Home hero section only.",
      "acceptanceCriteria": [
        "On all pages and at all breakpoints, the header area beside the logo does not show the tagline text.",
        "The institute name shown in the header is exactly “Shree Subodh Swadhyay Classes”.",
        "The Home page hero section still contains the tagline (no removal from hero)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Remove the header tagline text node (“Empowering Dreams, Inspiring Success”) from the logo/name block so only “Shree Subodh Swadhyay Classes” appears in the header across all breakpoints."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Verify the hero section still renders the tagline (“Empowering Dreams, Inspiring Success”) and remains unchanged after header edits."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Adjust header institute-name typography and responsive layout for readability on mobile while preserving header structure (logo left, hamburger right).",
      "acceptanceCriteria": [
        "Desktop (lg and above): the logo and institute name remain horizontally aligned within the header.",
        "Mobile: the institute name is readable without truncation/ellipsis and wraps cleanly to at most 2 lines.",
        "Mobile: institute name has clearly stronger visual hierarchy than other header elements (e.g., nav hidden, menu icon secondary).",
        "Institute name text color is Brand Blue (#010080) on a white header background, and uses a bold font weight.",
        "Header continues to show logo on the left and hamburger toggle on the right; no changes to routes, navigation items, CTAs, footer, or page content outside the header adjustments."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the header name styling and responsive layout: keep logo left + hamburger right; ensure desktop keeps logo+name horizontal; ensure mobile name wraps (no ellipsis/truncation), uses bold professional typography, strong hierarchy, adequate spacing, and high-contrast Brand Blue (#010080) on white using existing brand Tailwind utilities (no non-brand colors)."
        }
      ]
    }
  ]
}